Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་རབ་ཏུ་ཐོབ་ཅིང་དེ་དག་ལ་སྙོམ་པར་འཇུག་པ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབ་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྟོང་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྟོང་སྣང་བར་བྱེད་པ་དང་། སེམས་ཅན་བརྒྱ་སྟོང་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་བརྒྱ་སྟོང་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་རྣམ་པར་འབྱེད་པ་དང་། ལུས་བརྒྱ་སྟོང་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་བརྒྱ་སྟོང་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ། དེ་དག་གི་ལུས་སམ་འོད་དམ། རྫུ་འཕྲུལ་ལམ། མྱིག་གམ་སྤྱོད་ཡུལ་ལམ་དབྱངས་སམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains and rests in a hundred thousand samādhis, sees a hundred thousand buddhas and knows their blessings, causes a hundred thousand worlds to shake, goes to a hundred thousand buddha realms, illuminates a hundred thousand worlds, ripens a hundred thousand beings, remains for a hundred thousand eons, enters a hundred thousand previous eons and a hundred thousand future eons, opens a hundred thousand Dharma doors, manifests a hundred thousand bodies, and manifests each body having a retinue of a hundred thousand bodhisattvas.

source: སྤྱོད་པ་འམ། རྒྱན་ཏམ། བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་བ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའ་འོ།
en: “From this time onward the bodhisattvas, with the power of prayer and through particular prayers, manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོས་སའི་དོན་འདི་ཉིད་ཡང་བརྟག་པ་དང་བསྟན་པར་བྱ་བའི་ཕྱིར། །དེའི་ཚ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva mahāsattva Vajra­garbha, in order to teach the meaning of this bhūmi and to analyze it, recited these verses:

source: །དེ་དག་ཡོན་ཏན་འབྱུང་གནས་བསམ་དག་སེམས་དེས་པ།
en: “They have pure intention, are the source of qualities, and are constant.

source: །སྐྱོ་ཞིང་འདོད་ཆགས་བྲལ་ཏེ་འཚེ་མེད་སེམས་དང་ལྡན།
en: They are disenchanted, have no desires, and are irreversible.

source: །སེམས་བསྐྱེད་བསྟན་པ་དགའ་ལྡན་རྒྱ་ཆེན་ཤུགས་ཅན་རྣམས།
en: They have resolute motivation, refined, insatiable application, and sublime power,

source: །མཁས་པ་བདག་ཉིད་ཆེ་བའི་སེམས་ལྡན་གསུམ་པ་གནོན།
en: Are wise with exalted intention, and reach the third bhūmi.

source: །འོད་བྱེད་ས་ཕྱོགས་འདི་ལ་གནས་པའི་མཁས་པ་ནི།
en: “The wise ones on this bhūmi called Shining know That composite phenomena have the qualities of impermanence, foulness, and destruction

source: །སྡུག་བསྔལ་མི་རྟག་མི་སྡུག་རབ་ཏུ་འཇིག་ཆོས་དང་། །རིང་པོར་མི་གནས་སྐད་ཅིག་སྙིང་པོ་མེད་པ་ནི།
en: And are transitory, are momentary, and cease. They regard the nature of composite phenomena to be without origination. “They see composite phenomena as an infinite fire

source: །འདུས་བྱས་རྣམ་པ་འོང་བ་མེད་ལ་རབ་ཏུ་རྟོག །ནད་དུ་གྱུར་པ་མྱ་ངན་སྨྲེ་སྔགས་འདོན་དང་བཅས།
en: Where one falls ill, where there is misery and wailing,

source: །གནོད་དང་འཁྲུག་དང་སྡུག་དང་མི་སྡུག་རྗེས་འབྲང་བ།
en: Distress, and the bondage of pleasure and displeasure,

source: །སྡུག་བསྔལ་ཡིད་བློང་ཕུང་པོ་འབར་བའི་མེ་འདྲ་བར། །འདུས་བྱས་མཐའ་ཡས་ཀུན་ནས་འབར་མཐོང་དེ་ལས་སྐྱེད།
en: A place of suffering and unhappiness like a blazing inferno.

source: །སྲིད་པ་གསུམ་པོ་ཀུན་ལས་སྐྱོ་ཞིང་ལྟོས་སེམས་མེད།
en: “They are disenchanted with the three existences and indifferent to them.

source: །བདེ་གཤེགས་ཡེ་ཤེས་འདོད་ཅིང་བློ་གཞན་མེད་པ་སྟེ།
en: They desire the wisdom of the sugatas and are intent on nothing else. They see the wisdom of the jinas as inconceivable,

source: །བསམ་དུ་མེད་ཅིང་གཞལ་ཡས་ཕ་རོལ་མཐའ་ཡས་པའི།
en: Unequaled, the incomparable ultimate, and inviolable.

source: །རྒྱལ་བའི་ཡེ་ཤེས་གནོད་མེད་དེ་དག་རབ་ཏུ་མཐོང་།
en: “Desiring the invulnerable wisdom of the buddhas,

source: །དེ་དག་སངས་རྒྱས་ཡེ་ཤེས་གནོད་མེད་མཐོང་གྱུར་ནས།
en: They engage in constant diligence while thinking,

source: །སྐྱབས་མེད་མགོན་དང་བྲལ་བ་རབ་ཏུ་དགྲོལ་བའི་ཕྱིར།
en: ‘I will protect those who are wandering forsaken without protector or refuge,

source: །རྟག་ཏུ་དབུལ་ཞིང་མེ་གསུམ་ཀུན་ནས་འབར་གྱུར་དང་། །སྲིད་པའི་བཙོན་རར་སྡུག་བསྔལ་སྣ་བརྒྱས་སེམས་བསྐོར་ཅིང་།
en: Always destitute and burned by the three fires, “ ‘Their minds bound by hundreds of sufferings in the dungeon of existence,

source: །ཉོན་མོངས་བསྒྲིབས་དང་རྣམ་པར་ལྟ་དང་འདོད་ཉམས་པ།
en: Enveloped by the kleśas, having incorrect view and no aspiration,

source: །བདེ་གཤེགས་ཆོས་ཀྱི་དགའ་བ་སྟོར་བའི་བྱིས་པ་རྣམས།
en: Childlike beings have no delight in the teaching of the sugatas,

source: །འཁོར་བའི་རྒྱུད་དུ་འབབ་ཅིང་ཐར་བས་སྔངས་གྱུར་པ། །བདག་གིས་སྐྱབས་པ་ཡིན་ཞེས་བརྩོན་འགྲུས་དམ་དུ་རྩོམ།
en: And they are swept away by the current of saṃsāra and terrified of liberation.’

source: །ཡེ་ཤེས་འདོད་པས་ལྟོས་པ་མེད་པར་འགྲོ་དོན་བྱེད།
en: “They desire knowledge and impartially benefit beings.

source: །གང་རྒྱུས་རྣམ་ཐར་ལམ་གྱི་རྒྱུ་ནི་གང་ཞེས་རྟོག །བདེ་གཤེགས་ཡེ་ཤེས་བསྒྲིབས་པ་མེད་ལས་གཞན་མེད་ན།
en: They consider, ‘What is the cause for the liberation of beings?’ The bodhisattva concludes, ‘There is none other than the unobscured knowledge of the tathāgatas,

source: །བདེ་གཤེགས་ཡེ་ཤེས་དེ་ཡང་ཤེས་རབ་མཐུས་འབྱུང་སྟེ།
en: A knowledge that arises from the infinite wisdom of the sugatas, “ ‘And that wisdom comes from listening to the Dharma.’

source: །ཤེས་རབ་ཐོས་ལས་འབྱུང་བར་བྱང་ཆུབ་སེམས་དཔའ་རྟོག །དེ་ལྟར་ཤེས་ནས་ཐོས་དོན་སྤྱད་པར་བརྩོན་འགྲུས་རྩོམ།
en: Knowing that, they practice with diligence the meaning they have heard.

source: །ཉིན་མཚན་ཉན་པའི་རྒྱུར་སྤྱོད་བྱ་བ་གཞན་མྱེད་པར།
en: Day and night, they act only in order to listen to the Dharma.

source: །ཆོས་ཀྱི་དོན་གཉེར་ཆོས་ལ་རབ་ཏུ་བརྟེན་པ་ཡིན།
en: They are devoted to the Dharma and wish to accomplish its meaning. “The wise, for the sake of the Dharma, give away without holding back

source: །ནོར་བུ་མུ་ཏིག་རིན་ཆེན་ཚོགས་དང་མཛའ་གཉེན་དང་། །སྲིད་ལོངས་དུ་མ་ཕོ་བྲང་ཕུན་ལྡན་དམ་པ་དང་། །ཆུང་མ་དག་དང་བུ་དང་མཐུན་པར་སྤྱོད་པའི་འཁོར། །ལྟོས་མེད་སེམས་ཀྱིས་མཁས་པ་ཆོས་ཀྱི་དོན་དུ་གཏོང་།
en: Their precious jewels and pearls, their friends and family, Their endless kingdoms, their perfect, sublime palaces, Their wives, their sons, and their faithful retinues.

source: མགོ་དང་རྐ་ལག་མྱིག་དང་དེ་བཞིན་བདག་གི་ཤ།
en: “They give their heads, legs, arms, and eyes, their own flesh,

source: །ལྕེ་དང་མཆེ་བ་རྣ་བ་སྣ་དང་ཁྲག་རྣམས་དང་། །ཕངས་པའི་རྐང་དང་སྙིང་ཕྱུང་ཡོངས་སུ་གཏོང་བ་བྱེད།
en: Their tongues, teeth, noses, ears, and blood. They even pull out their hearts and their marrow

source: །འདི་ནི་དཀའ་བར་མི་བརྩི་ཐོས་པ་དེ་དཀར་བརྩི།
en: And do not see it as a hardship they have to endure.

source: །ལ་ལ་དེ་དྲུང་འོངས་ཤིང་འདི་སྐད་སྨྲར་གྱུར་ཏེ།
en: “If someone were to come and say to them,

source: །དེ་སྟེ་མེ་ལྕེ་མི་ཟད་འབར་དོང་མཆོང་ཕོད་ན།
en: ‘If you dare to leap into that fiercely blazing fire pit

source: །བདེ་གཤེགས་བསྟན་ཆོས་རིན་ཆེན་བཤད་དོ་ཞེས་ན་ཡང་།
en: I will teach you the precious teaching of the Sugata,’

source: །ཐོས་ནས་མི་དམའི་ཡིད་ཀྱིས་ཡོན་ཏན་དོན་དུ་མཆོང་།
en: Hearing that, for the sake of qualities they would jump in without hesitation.

source: །ཆོས་ཀྱི་ཚིག་གཅིག་དོན་དུ་རི་རབ་རྩེས་བརྟག་པར།
en: “They say, ‘For the sake of one word of Dharma, which is like the summit of Sumeru,

source: །སྟོང་གསུམ་མེས་བཀང་ཚངས་རིས་ཡུལ་ནས་མཆོངས་གྱུར་ཀྱང་།
en: I would jump from the realm of Brahmā into a fire that fills the universe.

source: །ད་དུང་རྒྱལ་བའི་བྱང་ཆུབ་ཡངས་པ་ཐོབ་དཀའ་ན།
en: The enlightenment of the Jina is hard to obtain,

source: །དེ་སྟེ་ཐ་མལ་མི་བདེས་རྙེད་འགྱུར་ཤིན་ཏུ་བདེ།
en: While the happiness of humans is easy to obtain.

source: །དྲང་སྲོང་མཆོག་གི་ཡེ་ཤེས་འཐོབ་འགྱུར་ཇི་སྲིད་པ།
en: ‘In order to attain the wisdom of the supreme sage,

source: །དེ་སྲིད་བར་དུ་མནར་མེད་སྡུག་བསྔལ་བཟོད་བྱ་ན།
en: I would endure the suffering of the Avīci hell. So, needless to say, in order to hear the Dharma

source: །མི་ཡི་སྡུག་བསྔལ་ཕུང་པོ་སྣ་ཚོགས་ཅི་སྨོས་ཀྱིས། །ཆོས་རབ་མཉན་པའི་དོན་དུ་བདག་གིས་ཉམས་བླང་ཞེས།
en: I would take on a mass of all kinds of human suffering.’

source: །ཆོས་རྣམས་ཐོས་པར་གྱུར་ནས་ཚུལ་བཞིན་སེམས་པར་བྱེད།
en: “Having heard the Dharma, they contemplate it accordingly

source: །བསམ་གཏན་ཚད་མེད་དེ་བཞིན་གཟུགས་མེད་རྣམ་པ་བཞི།
en: And attain the immeasurable dhyānas and similarly

source: མངོན་པར་ཤེས་པའི་དམ་པ་ལྔ་པོ་མངོན་སྒྲུབ་ཀྱང་།
en: The four formless states and the five sublime clairvoyances,

source: །དེ་དག་དབང་གིས་སྐྱེ་བར་དེ་དག་འགྱུར་བ་མིན།
en: But those powers do not cause them to be reborn.

source: །ལེགས་ལྡན་འདི་གནས་སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་ལ།
en: “On this bhūmi these possessors of qualities make offerings

source: །མཆོད་པ་བྱེད་ཅིང་དེས་རྟོགས་ཡིད་ཀྱིས་ཆོས་ཀྱང་ཉན།
en: To many millions of buddhas and listen with certainty to the Dharma.

source: །སྲབས་པར་གྱུར་ཅིང་ལོག་བྲལ་ཡོངས་སུ་དག་པར་འགྱུར།
en: They reach subtlety, are free from wrong, and become purified.

source: །སྐྱོན་མེད་གསེར་སྦྲམ་ཇི་ལྟར་སྲང་ལ་བཅལ་བ་བཞིན།
en: They become faultless to the same extent as refined gold.

source: །དེ་གནས་ཡོན་ཏན་ལྡན་པ་ལྷ་ཡི་བདག་པོ་སྟེ།
en: “Those on this bhūmi are endowed with qualities and become lords of gods.

source: །དབང་སྒྱུར་དོན་བྱེད་འདོད་པའི་ནད་ཀྱི་རྣམ་པ་སེལ།
en: They attain the power to eliminate the illness of desire.

source: །ལྷ་མང་སྣ་ཚོགས་དུ་མ་དགེ་བའི་ལམ་ལ་དགོད།
en: They bring many kinds of deities to the path of goodness.

source: །སངས་རྒྱས་ཡོན་ཏན་མངོན་འདོད་བསམ་པ་གཞན་ཡང་མྱེད།
en: They desire only the qualities of buddhahood and think of nothing else.

source: །འདི་ལ་གནས་པའི་རྒྱལ་སྲས་བརྩོན་འགྲུས་རབ་རྩོམ་སྟེ།
en: “The bodhisattvas on this bhūmi practice with diligence.

source: །བརྒྱ་ཕྲག་སྟོང་ལས་མི་ཉུང་ཏིང་འཛིན་ཐོབ་པ་ཡིན།
en: They attain no less than a hundred thousand samādhis.

source: །མཚན་རབ་སྐུ་བརྒྱན་སངས་རྒྱས་རྣམས་ཀྱང་རབ་ཏུ་མཐོང་།
en: They see the buddhas, their bodies adorned with wonderful signs,

source: །ཡན་ཅད་སྨོན་ལམ་རབ་ལྡན་ཡོན་ཏན་བསམ་མི་ཁྱབ།
en: And moreover have powerful prayers and inconceivable qualities.”

source: །དེ་ལྟར་ས་མཆོག་གསུམ་པ་འདི།
en: In that way the supreme third bhūmi

source: །འཇིག་རྟེན་ཀུན་ལ་ཕན་བརྩོན་པའི།
en: Was taught to the bodhisattvas,

source: །བྱང་ཆུབ་སེམས་དཔའི་མཆོག་རྣམས་ལ། །རྒྱལ་བའི་སྲས་ཀྱིས་བསྟན་པ་ཡིན།
en: To the supreme bodhisattvas Who diligently benefit all beings.

source: །འོད་བྱེད་པ་ཞེས་བྱ་བ་སྟེ།
en: That which is called Shining

source: བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པའོ། །ས་མཆོག་དམ་པ་ཡིད་འོང་ཕུལ་གྱི།
en: Is the third bodhisattva bhūmi.

source: །སྤྱོད་པ་ཡངས་པ་འདི་འདྲ་ཐོས་ནས།
en: After hearing about the vast conduct of this Beautiful, supreme, sublime bhūmi,

source: །རྒྱལ་སྲས་ཡིད་དགའ་ཤིན་ཏུ་མགུ་གྱུར།
en: The gladdened bodhisattvas were pleased

source: །རྒྱལ་བ་ལ་ནི་མེ་ཏོག་མངོན་འཐོར།
en: And scattered flowers to the Jina.

source: །ཆོས་འདི་ཤིན་ཏུ་བསྟན་ཅིང་བརྗོད་པས།
en: Because this Dharma was well taught and explained,

source: །ལན་ཚྭའི་གང་ཆེན་མཚོ་ཡང་གཡོས་འགྱུར།
en: Even the great ocean filled with saltwater shook.

source: །ལྷ་ཡི་བུ་མོ་ཡིད་འོང་སྙན་པའི།
en: Beautiful divine maidens sang of the Dharma

source: །གླུ་ཡི་དབྱངས་སུ་ཆོས་རབ་དབྱངས་ལེན།
en: With the music of beautiful songs.

source: །དབང་བསྒྱུར་ལྷ་དབང་ཤིན་ཏུ་ཡིད་དགའ། །བདེ་གཤེགས་རིན་ཆེན་ལྷ་རྫས་ནོར་འཐོར།
en: The lord of the Vaśavartin deities was very happy And scattered divine jewels over the Sugata. “Speak, Jina, you who have accomplished the goal

source: །དོན་གྲུབ་ཡོན་ཏན་ཕ་རོལ་ཕྱིན་པའི། །རྒྱལ་བ་དེ་ཚེ་གསུང་རབ་སྒྲོག་མཛད།
en: And attained the perfect qualities.

source: །ཅི་ཕྱིར་ཞེ་ན་ཆོས་ཀྱི་དམ་པ།
en: “What is the purpose of the sublime Dharma

source: །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་རབ།
en: And the perfect conduct of the bodhisattva?

source: །དེ་རིང་འདིར་ཐོས་མཁས་པའི་ས་དེ།
en: This bhūmi that the wise have heard of here today

source: །བསྐལ་པ་བརྒྱར་ཡང་ཐོས་པར་རབ་དཀའ།
en: Would be difficult to hear of in a hundred eons.

source: །རྒྱལ་སྲས་མཁས་ལ་སྤྱོད་པའི་དམ་པ།
en: “The sublime conduct of the wise bodhisattvas

source: །ལྷ་དང་མི་ལ་ཕན་པས་ཡང་ཤོད། །ས་དོན་ངེས་པར་མ་ནོར་ལམ་འདི།
en: Is beneficial for deities and humans, so say more!

source: །ལྷ་མང་འདི་དག་ཡིད་དགའ་ཉན་འགྱུར། །བདེ་བར་གཤེགས་པའི་སྲས་པོ་ལ།
en: This multitude of deities will be overjoyed to hear The meaning of the bhūmi, this definite unmistaken path.”

source: །རྣམ་ཐར་ཟླ་བས་ཡང་སྨྲས་པ།
en: Vimukti­candra then said: “Teach the wise conduct

source: །བཞི་པོར་ཡང་དག་འཕར་བ་ཡི། །སྤྱོད་ཡུལ་མཁས་པས་བཤད་པར་མཛོད།
en: That ascends to the fourth bhūmi.”

source: །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ།
en: The bodhisattva Vajra­garbha said, “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པ་ལ་སྣང་བ་ཤིན་ཏུ་སྦྱང་བ་ནི། །བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པ་ཡོངས་སུ་གནོན་ཏེ།
en: In that way the bodhisattva who has perfectly purified insight on the third bodhisattva bhūmi Shining ascends to the fourth bodhisattva bhūmi.

source: །དེ་ཆོས་སྣང་བ་ལ་འཇུག་པ་བཅུ་ཡོངས་སུ་གནོན་ཏེ།
en: He ascends because of ten attainments through insight into the Dharma.

source: །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these ten?

source: སེམས་ཅན་གྱི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། ཆོས་ཀྱི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་ནམ་མཁའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། །རྣམ་པར་ཤེས་པའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། འདོད་པའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་གཟུགས་ཀྱི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། གཟུགས་མེད་པའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། བསམ་པ་དང་མོས་པ་ཡངས་པའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། བདག་ཉིད་ཆེ་བའི་བསམ་པ་དང་མོས་པའི་ཁམས་རྣམ་པར་དཔྱད་པ་སྣང་བ་ལ་འཇུག་པ་དང་། ཆོས་སྣང་བ་ལ་འཇུག་པ་བཅུ་པོ་འདི་དག་གིས་ཡོངས་སུ་གནོན་ཏོ།
en: They are (1) attainment through insight in analyzing the realms of beings, ( ) attainment through insight in analyzing the element of worlds, (3) attainment through insight in analyzing the element of phenomena, (4) attainment through insight in analyzing the element of space, (5) attainment through insight in analyzing the element of consciousnesses, (6) attainment through insight in analyzing the element of the desire realm, (7) attainment through insight in analyzing the element of the form realm, (8) attainment through insight in analyzing the element of the formless realm, (9) attainment through insight in analyzing the elements of sublime intention and aspiration, and (10) attainment through insight in analyzing the elements of exalted motivation. “They ascend because of these ten attainments through insight.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་དེའི་བདག་ཉིད་ཀྱི་ཆོས་རབ་ཏུ་འཐོབ་པའི་ཕྱིར་ཡེ་ཤེས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཆོས་བཅུས་ཡང་དག་པར་བྱུང་བ་ཡིན།
en: “O jinaputras! When the bodhisattva attains the bodhisattva bhūmi named Brilliance he becomes one of the tathāgata family through attaining its qualities, the ten qualities that ripen wisdom.

source: ཕྱིར་མི་ལྡོག་པའི་བསམ་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་དད་པ་མྱི་ཕྱེད་པ་རབ་ཏུ་ཐོབ་པའི་མཐར་ཐུག་པ་དང་། འདུ་བྱེད་སྐྱེ་བ་དང་། འཇིག་པ་རྣམ་པར་བསྒོམ་པ་དང་། རང་བཞིན་གྱིས་མ་སྐྱེས་པ་རྣམ་པར་བསྒོམ་པ་དང་། འཇིག་རྟེན་རྒྱུ་ཞིང་ལྡོག་པ་རྣམ་པར་བསྒོམ་པ་དང་། ལས་ཀྱིས་སྲིད་པར་སྐྱེ་བ་རྣམ་པར་བསྒོམ་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་རྣམ་པར་བསྒོམ་པ་དང་། སེམས་ཅན་གྱི་ཞིང་དང་ལས་རྣམ་པར་བསྒོམ་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་རྣམ་པར་བསྒོམ་པ་དང་། མྱེད་པའི་མཐའ་དང་ཟད་པའི་མཐའ་རྣམ་པར་བསྒོམ་པ་སྟེ།
en: They are (1) irreversible motivation, ( ) attaining the consummate state of stainless faith in the Three Jewels, (3) contemplation on the arising and ceasing of composite phenomena, (4) contemplation on natural nonarising, (5) contemplation on the appearance and dissolution of worlds, (6) contemplation on taking birth in an existence through karma, (7) contemplation on saṃsāra and nirvāṇa, (8) contemplation on the karma for beings to be in buddha realms, (9) contemplation on the past and the future, and (10) contemplation on nonexistence and annihilation.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །ཡེ་ཤེས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཆོས་བཅུ་པོ་འདི་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་དེའི་བདག་ཉིད་ཀྱི་ཆོས་རབ་ཏུ་འཐོབ་པའི་ཕྱིར་ཡང་དག་པར་བྱུང་བ་ཡིན།
en: “O jinaputras, the bodhisattva mahāsattva becomes one of the tathāgata family through attaining these qualities, the ten qualities that ripen wisdom.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཡོངས་སུ་སྦྱོང་བ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ།
en: “O jinaputras, the bodhisattva on the Brilliance bodhisattva bhūmi has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of the body based upon the interior of his own body.

source: ནང་གི་ལུས་ལ་ལུས་ཀྱིས་རྗེས་སུ་ལྟ་བར་གནས་སོ། །ཡོངས་སུ་སྤྱོད་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ།
en: “He has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of the body based upon the exterior of his own body.

source: ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བར་གནས་སོ། །སྤྱོད་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ། ཕྱི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བར་གནས་སོ།
en: “He has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of the body based upon the exterior and interior of his own body.

source: །དེ་བཞིན་དུ་ནང་གི་ཚོར་བ་དང་། ཕྱི་རོལ་གྱི་ཚོར་བ་དང་། ཕྱི་ནང་གི་ཚོར་བ་དང་། དེ་བཞིན་དུ་ནང་གི་སེམས་དང་། ཕྱི་རོལ་གྱི་སེམས་དང་། ཕྱི་ནང་གི་སེམས་ལ་ལྟ་སྟེ་སྤྱོད་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ།
en: “Similarly, he maintains the observation of sensation based upon internal sensation, external sensation, and external and internal sensation. “Similarly, he maintains the observation of mind based upon internal mind, external mind, and external and internal mind. “He has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of phenomena based upon interior phenomena.

source: ནང་གི་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བར་གནས་སོ། །ཡོངས་སུ་སྤྱོད་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ།
en: “He has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of phenomena based upon external phenomena.

source: ཕྱི་རོལ་གྱི་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བར་གནས་སོ། །ཡོངས་སུ་སྤྱོད་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པར་འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་སྤངས་ཏེ།
en: “He has dedication, awareness, and mindfulness, has eliminated worldly longing and unhappiness, and maintains the observation of phenomena based upon exterior and interior phenomena.

source: ཕྱི་ནང་གི་ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བར་གནས་སོ། །དེ་སྡིག་ཏོ་དང་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེ་བའི་ཕྱིར་དང་པ་སྐྱེད་དོ། །རྩོལ་ལོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཛིན་ཏོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ།
en: “Because he does not give rise to bad, nonvirtuous qualities that have not been created, he gives rise to faith, exerts effort, generates diligence, controls his mind, and focuses it correctly.

source: །སྡིག་ཏོ་དང་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་དད་པ་སྐྱེད་དོ། །རྩོལ་ལོ།
en: “Because he eliminates the bad and nonvirtuous qualities that he has previously created, he gives rise to faith, exerts effort, generates diligence, controls his mind, and focuses it correctly.

source: བརྩོན་འགྲུས་རྩོམ་མོ་སེམས་རབ་ཏུ་འཛིན་ཏོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ། །དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་སྐྱེ་བར་འགྱུར་བར་དད་པ་སྐྱེད་དོ། །རྩོལ་ལོ།
en: “Because he creates virtuous qualities that he has not previously created, he gives rise to faith, exerts effort, generates diligence, controls his mind, and focuses it correctly.

source: །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཛིན་ཏོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ། །དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། མི་ཉམས་པ་དང་། རྒྱ་ཆེར་འགྱུར་བ་དང་། དེ་བས་ཀྱང་འཕེལ་བར་འགྱུར་བ་དང་། བསྒོམ་པ་དང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཕྱིར་དད་པ་སྐྱེད་དོ། །རྩོལ་ལོ།
en: “Because the virtuous qualities he has created remain, and because they do not deteriorate but increase, develop even further, are meditated on, and are brought to perfection, he gives rise to faith, exerts effort, generates diligence, controls his mind, and focuses it correctly.

source: བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་རབ་ཏུ་འཛིན་ཏོ། །སྨོན་ལམ་ཡང་དག་པར་འདེབས་སོ། །དེ་མོས་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the foundation for miraculous powers that is the samādhi of aspiration that possesses the mental activity of elimination based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the foundation for miraculous powers that is the samādhi of diligence that possesses the mental activity of elimination based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ།
en: “He cultivates the foundation for miraculous powers that is the samādhi of motivation that possesses the mental activity of elimination based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: །དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the foundation for miraculous powers that is the samādhi of analysis that possesses the mental activity of elimination based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དད་པའི་དབང་པོ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the power of faith based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དབེན་པ་ལ་གནས་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the power of diligence based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དྲན་པའི་དབང་པོ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the power of mindfulness based on detachment, based on absence of desire, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the power of samādhi based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.
